/**
 * Стратегия — это поведенческий паттерн проектирования, который определяет семейство схожих
 * алгоритмов и помещает каждый из них в собственный класс,
 * после чего алгоритмы можно взаимозаменять прямо во время исполнения программы.
 * 
 * например у нас есть навигатор, который может вычислять маршруты для пешеходов, автомобилистов и общественного
 * транспорта
 * мы можем выдаелить алгоритм для вычисления маршрутов для каждого типа в свой собтвенный класс, но все они должны
 * името общий интерфейс.
 */