/**
 * Абстрагирование — это способ выделить набор значимых характеристик объекта, исключая
 * из рассмотрения не значимые  Соответственно, абстракция — это набор всех таких характеристик.

Инкапсуляция — это свойство системы, позволяющее объединить данные и методы, работающие 
с ними в классе, и скрыть детали реализации от пользователя.

Наследование — это свойство системы, позволяющее описать новый класс на основе уже существующего
с частично или полностью заимствующейся функциональностью. Класс, от которого производится наследование,
называется базовым, родительским или суперклассом. Новый класс — потомком, наследником или производным классом

Полиморфизм — это свойство системы использовать объекты с одинаковым интерфейсом
без информации о типе и внутренней структуре объекта.
 */